src/test/resources/com/stripe/model/charge.json

{
  "id": "ch_198c152iMoKf4jyWWYvyqjTX",
  "object": "charge",
  "amount": 1061,
  "amount_refunded": 0,
  "application": "ca_4UNPzRJlp7joZhEYfqkhc02MYvNFHJEX",
  "application_fee": null,
  "balance_transaction": "txn_198LO02iMoKf4jyW0Mr72NYD",
  "captured": true,
  "created": 1477429167,
  "currency": "usd",
  "customer": null,
  "description": "My Description.",
  "dispute": null,
  "failure_code": null,
  "failure_message": null,
  "fraud_details": {
  },
  "invoice": null,
  "livemode": false,
  "metadata": {},
  "order": null,
  "outcome": {
    "network_status": "approved_by_network",
    "reason": null,
    "risk_level": "normal",
    "seller_message": "Payment complete.",
    "type": "authorized"
  },
  "paid": true,
  "receipt_email": null,
  "receipt_number": null,
  "refunded": false,
  "refunds": {
    "object": "list",
    "data": [

    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges/ch_198c152iMoKf4jyWWYvyqjTX/refunds"
  },
  "review": "prv_197BDeCKM4Inl33zU8jDaYKE",
  "shipping": null,
  "source": {
    "id": "card_198c102iMoKf4jyWkVgJ7l6S",
    "object": "card",
    "address_city": null,
    "address_country": null,
    "address_line1": null,
    "address_line1_check": null,
    "address_line2": null,
    "address_state": null,
    "address_zip": null,
    "address_zip_check": null,
    "brand": "Visa",
    "country": "US",
    "customer": null,
    "cvc_check": null,
    "dynamic_last4": null,
    "exp_month": 2,
    "exp_year": 2017,
    "funding": "credit",
    "last4": "4242",
    "metadata": {}
  },
  "source_transfer": null,
  "statement_descriptor": null,
  "status": "succeeded",
  "transfer": "tr_198c152iMoKf4jyWEqDmkAmZ"
}